# **Задача:**

Написать программу, которая из имеющегося массива из строк, длина которых меньше или равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

# **Решение:**

1) Создать возможность для пользователя ввести массив:

        System.Console.WriteLine("Введите массив через запятую: ");

        string words = Console.ReadLine();

2) Разделить элементы массива:

        string[] existArr = words.Split(", ");

3) Проверить каждый элемент массива на соответствующий условию размер. В случае соответствия - записать в новый массив:

        string[] resultArr = existArr.Where(words=>words.Length < 4).ToArray();

4) Вывести результат:

        System.Console.WriteLine(String.Join(", ", resultArr));
